content/wiki/imperfect-vs-preterite.md
+++
title = "Retelling the Past: Imperfect vs. Preterite"
author = ["Zhenkai Weng"]
date = 2020-09-05
tags = ["verb", "grammar"]
draft = false
toc = true
+++

<div class="OPTIONS">
  <div></div>



</div>

Unlike English, Spanish has two types of past tenses, the imperfect and the preterite. Here's a detailed guide to both of these tenses.  


## Imperfect (el imperfecto) {#imperfect--el-imperfecto}

The imperfect is appropriate when the usage applies to a time _range_ in the past.  


### Imperfect Conjugation {#imperfect-conjugation}

Remove the ending (-ar, -er, or -ir) to get the verb stem, then add the corresponding suffix.  


#### _-ar_ verbs {#ar-verbs}

| Subject          | _-ar_ ending |
|------------------|--------------|
| yo               | -aba         |
| tú               | -abas        |
| él/ella/Ud.      | -aba         |
| nosotros         | -ábamos      |
| vosotros         | -abais       |
| ellos/ellas/Uds. | -aban        |

Note that there is an accent on the first _a_ for the _nosotros_ ending.  


#### _-er_, _-ir_ verbs (same endings) {#er-ir-verbs--same-endings}

| Subject          | _-er_, _-ir_ ending |
|------------------|---------------------|
| yo               | -ía                 |
| tú               | -ías                |
| él/ella/Ud.      | -ía                 |
| nosotros         | -íamos              |
| vosotros         | -íais               |
| ellos/ellas/Uds. | -ían                |


#### Irregular verbs in imperfect {#irregular-verbs-in-imperfect}

<!--list-separator-->

-  ir (to go)

    | Subject          | Conjugation |
    |------------------|-------------|
    | yo               | iba         |
    | tú               | ibas        |
    | él/ella/Ud.      | iba         |
    | nosotros         | íbamos      |
    | vosotros         | íbais       |
    | ellos/ellas/Uds. | iban        |

<!--list-separator-->

-  ver (to see)

    | Subject          | Conjugation |
    |------------------|-------------|
    | yo               | veía        |
    | tú               | veías       |
    | él/ella/Ud.      | veía        |
    | nosotros         | veíamos     |
    | vosotros         | veíais      |
    | ellos/ellas/Uds. | veían       |

<!--list-separator-->

-  ser (to be)

    | Subject          | Conjugation |
    |------------------|-------------|
    | yo               | era         |
    | tú               | eras        |
    | él/ella/Ud.      | era         |
    | nosotros         | éramos      |
    | vosotros         | erais       |
    | ellos/ellas/Uds. | eran        |


### Trigger words {#trigger-words}

Frequency words are good indicators that you should be using the imperfect instead of the preterite for past tense. To list a few:  

-   siempre
-   a veces
-   cada día / semana / mes / año / ...
-   normalmente
-   generalmente


### When to use Imperfect {#when-to-use-imperfect}

Observe how the following usages of the imperfect tense do not have a well-defined time of termination.  


#### Description {#description}

The speaker used the imperfect tense in the following examples because the description applies to time ranges (childhood & a visit) that had neither a clear-cut beginning nor end.  

> _Era_ bien educado de niño.  
> I was well-behaved as a child.  

<!--quoteend-->

> Ese lugar _era_ hermoso.  
> That place was beautiful.  


#### Simultaneous action (on-going, long duration) {#simultaneous-action--on-going-long-duration}

> Cuando _hacía_ mi tarea, también _escuchaba_ a música.  
> When I do my homework, I also listen to music.  


#### Recurring action ("used to") (habitual) {#recurring-action--used-to----habitual}

> Todos los días _practicaba_ el saxofón después la escuela.  
> I practice the saxophone after school every day.  


#### Telling age (on-going year) {#telling-age--on-going-year}

> _Tenía_ 16 años cuando nos conocimos.  
> I was 16 years old (imperfect) when we first met (preterite).  


#### Telling time {#telling-time}

> _Eran_ seis y media por la noche.  
> It was 6:30 PM.  


#### On-going emotions {#on-going-emotions}

> Entré el cuarto y me _sentía_ muy ansioso.  
> I entered the room and I felt very anxious.  


#### Setting the background when telling a story {#setting-the-background-when-telling-a-story}

> _Había_ una vez una princesa que _vivía_ en un castillo.  
> Once upon a time, there lived a princess in a castle.  


#### Past Progressive {#past-progressive}

> _Estaba_ cantando.  
> I was singing  


## Preterite (el pretérito) {#preterite--el-pretérito}

You should use the preterite when the action applies to only _one point_ in time.  


### Preterite Conjugation {#preterite-conjugation}

Remove the verb ending (_-ar_, _-er_, _-ir_), then add the corresponding suffix.  


#### _-ar_ verbs {#ar-verbs}

| Subject          | _-ar_ ending |
|------------------|--------------|
| yo               | -é           |
| tú               | -aste        |
| él/ella/Ud.      | -ó           |
| nosotros         | -amos        |
| vosotros         | -asteis      |
| ellos/ellas/Uds. | -aron        |

And yes, the conjugation is the same under present tense and the imperfect tense for _nosotros_.  


#### _-er_, _-ir_ verbs (same endings) {#er-ir-verbs--same-endings}

| Subject          | _-er_, _-ir_ ending |
|------------------|---------------------|
| yo               | -í                  |
| tú               | -iste               |
| él/ella/Ud.      | -ió                 |
| nosotros         | -imos               |
| vosotros         | -isteis             |
| ellos/ellas/Uds. | -ieron              |


### When to use Preterite {#when-to-use-preterite}

Observe how the follow usages of the preterite are all simple events with a definite beginning and end.  


#### Beginning / end of action {#beginning-end-of-action}

Keywords: empezer / comenzar / terminar / completer / ...  

> _Empezó_ a lavar mi coche.  
> I began to wash my car.  


#### An one-off, completed action {#an-one-off-completed-action}

> _Puso_ la servilleta en la mesa.  
> He put the napkin on the table.  


#### Summary of emotion {#summary-of-emotion}

> Simplemente me sentí tan airado.  
> I simply felt so angry.  


#### Interruption {#interruption}

> Montaba en bici hacia la escuela. De repente, se me _pinchó_ un neumático.  
> I biked (was biking) towards the school. Suddenly, I had a flat.  


#### Series of completed events {#series-of-completed-events}

> Me levanté, me vestí, y arreglé mi dormitorio.  
> I woke up, got dressed, then organized my bedroom.  


## A comparison {#a-comparison}

Some verbs like _saber_ and _querer_ have slightly different meanings if used in a different tense.  


### Saber {#saber}

-   sabía: knew something
-   supo: _found out_


### Querer {#querer}

-   quería: loved (on-going emotion)
-   quiso: loved (short; terminated), wanted
-   no (lo) quiso: _refused_
